      * CMQPMOV - opcoes do MQPUT (MQPMO) (layout do IBM MQ; escrito para o mini-CICS)
           10  MQPMO.
               15  MQPMO-STRUCID           PIC X(4)  VALUE 'PMO '.
               15  MQPMO-VERSION           PIC S9(9) BINARY VALUE 1.
               15  MQPMO-OPTIONS           PIC S9(9) BINARY VALUE 0.
               15  MQPMO-TIMEOUT           PIC S9(9) BINARY VALUE -1.
               15  MQPMO-CONTEXT           PIC S9(9) BINARY VALUE 0.
               15  MQPMO-KNOWNDESTCOUNT    PIC S9(9) BINARY VALUE 0.
               15  MQPMO-UNKNOWNDESTCOUNT  PIC S9(9) BINARY VALUE 0.
               15  MQPMO-INVALIDDESTCOUNT  PIC S9(9) BINARY VALUE 0.
               15  MQPMO-RESOLVEDQNAME     PIC X(48) VALUE SPACES.
               15  MQPMO-RESOLVEDQMGRNAME  PIC X(48) VALUE SPACES.
