      * DFHDIB - bloco de interface do DL/I (EXEC DLI)
       01  DLZDIB.
           02  DIBVER                  PIC X(2).
           02  DIBSTAT                 PIC X(2).
           02  DIBSEGM                 PIC X(8).
           02  DIBFIL01                PIC X.
           02  DIBFIL02                PIC X.
           02  DIBSEGLV                PIC X(2).
           02  DIBKFBL                 PIC S9(4) COMP.
           02  DIBDBDNM                PIC X(8).
           02  DIBDBORG                PIC X(8).
           02  DIBFIL03                PIC X(6).
